blog/2013-05-17-weekly-linkfest-17-dot-5-2013.html

<!DOCTYPE HTML>
<html>
<head>
	<meta charset="utf-8">
	<title>Weekend Linkfest 17.5.2013 - Everything Counts</title>
	<meta name="author" content="Ronert Obst">

	
	<meta name="description" content="Statistics and Machine Learning Open data: A new goldmine Exploring the geometry behind machine learning, data mining, etc. Harvard Stat 221 &#8220; &hellip;">
	
	<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

	<link href="/atom.xml" rel="alternate" title="Everything Counts" type="application/atom+xml">
	<link rel="canonical" href="">
	<link href="/favicon.png" rel="shortcut icon">
	<link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
	<!--[if lt IE 9]><![endif]-->
	<!--- MathJax Configuration -->

</head>

<body>
	<header id="header" class="inner"><h1><a href="/">Everything Counts</a></h1>
<nav id="main-nav"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</nav>
<nav id="mobile-nav">
	<div class="alignleft menu">
		<a class="button">Menu</a>
		<div class="container"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</div>
	</div>
	<div class="alignright search">
		<a class="button"></a>
		<div class="container">
			<form action="http://google.com/search" method="get">
				<input type="text" name="q" results="0">
				<input type="hidden" name="q" value="site:ronert-obst.com">
			</form>
		</div>
	</div>
</nav>
<nav id="sub-nav" class="alignright">
	<div class="social">
		
		
		<a class="google" href="https://plus.google.com/102717496982395822694?rel=author" title="Google+">Google+</a>
		
		
		<a class="twitter" href="http://twitter.com/ronert_obst" title="Twitter">Twitter</a>
		
		
		<a class="github" href="https://github.com/ronert" title="GitHub">GitHub</a>
		
    
		
		
		
		
		
		<a class="rss" href="/atom.xml" title="RSS">RSS</a>
		
	</div>
	<form class="search" action="http://google.com/search" method="get">
		<input class="alignright" type="text" name="q" results="0">
		<input type="hidden" name="q" value="site:ronert-obst.com">
	</form>
</nav>

</header>
	
		
	
	<div id="content" class="inner"><article class="post">
	<h2 class="title">Weekend Linkfest 17.5.2013</h2>
	<div class="entry-content"><div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Statistics and Machine Learning</h2>
<div class="outline-text-2" id="text-1">

<ul>
<li><a href="http://www.economist.com/news/business/21578084-making-official-data-public-could-spur-lots-innovation-new-goldmine?fsrc=rss%7Cbus">Open data: A new goldmine</a>
</li>
<li><a href="http://shapeofdata.wordpress.com/">Exploring the geometry behind machine learning, data mining, etc.</a>
</li>
<li><a href="http://harvarddatascience.com/2013/05/05/harvard-stat-221-statistical-computing-and-visualization-all-lectures-online/">Harvard Stat 221 &#8220;Statistical Computing and Visualization&#8221;: all lectures online by Harvard Data Science</a>
</li>
<li><a href="http://www.quora.com/Statistics-academic-discipline/What-is-the-major-difference-between-statistics-and-math-major-students/answer/Joe-Blitzstein?srid=he8P&amp;share=1">Joe Blitzstein&#8217;s answer to Statistics (academic discipline): What is the major difference between statistics and math major students?</a>
</li>
<li><a href="http://r4stats.com/2013/05/14/beginning-of-the-end-v2/">Forecast Update: Will 2014 be the Beginning of the End for SAS and SPSS?</a>
</li>
<li><a href="http://ift6266h13.wordpress.com/home/resources/">Resources for Representation Learning</a>
</li>
<li><a href="#--texblog-texblog">Recent Developments in Deep Learning</a>
</li>
<li><a href="http://www.cs.toronto.edu/~nitish/">Some nice deep learning papers</a>
</li>
<li><a href="http://deeplearning.net/tutorial/">Deep Learning Tutorials</a>
</li>
<li><a href="#DeepLearning-v0.1-documentation-Google-Deep-Learning---YouTube">Google Deep Learning - YouTube</a>
</li>
<li><a href="http://work.caltech.edu/library/">Machine Learning Video Library - Learning From Data (Abu-Mostafa)</a>
</li>
<li><a href="http://eventuallyalmosteverywhere.wordpress.com/2013/05/10/bayesian-inference-and-the-jeffreys-prior/">Bayesian Inference and the Jeffreys Prior</a>
</li>
<li><a href="http://nbviewer.ipython.org/5105037">Using Python to see how the Times writes about men and women</a>
</li>
<li><a href="http://appliedpredictivemodeling.com/blog/2013/4/29/feature-selection-strikes-back-part-1">Feature Selection Strikes Back (Part 1)</a>
</li>
<li><a href="http://appliedpredictivemodeling.com/blog/2013/5/8/feature-selection-strikes-back-part-2">Feature Selection 2 - Genetic Boogaloo</a>
</li>
<li><a href="http://izbicki.me/blog/markov-networks-monoids-and-futurama">Markov Networks, Monoids, and Futurama</a>
</li>
</ul>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">R Package of the Week</h2>
<div class="outline-text-2" id="text-2">

<ul>
<li><a href="http://cran.at.r-project.org/web/packages/xkcd/index.html">xkcd Plotting ggplot2 graphics in a XKCD style</a>
</li>
</ul>

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Paper of the Week</h2>
<div class="outline-text-2" id="text-3">

<ul>
<li><a href="http://www-stat.stanford.edu/~jhf/ftp/isle.pdf">Importance Sampled Learning Ensembles</a>
</li>
</ul>

</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Programming</h2>
<div class="outline-text-2" id="text-4">

<ul>
<li><a href="http://www.numbertheory.nl/2013/05/14/much-more-efficient-bubble-sort-in-r-using-the-rcpp-and-inline-packages/">Much more efficient bubble sort in R using the Rcpp and inline packages | NumberTheory</a>
</li>
<li><a href="http://raulraja.com/post/50282524432/scala-resources-community-links-for-the-newcomer">Scala Resources &amp; Community links for the newcomer</a>
</li>
<li><a href="http://www.nikhilgopal.com/2013/05/the-guerilla-guide-to-r.html">The Guerilla Guide to R</a>
</li>
<li><a href="http://kbroman.github.io/github_tutorial/">git/github guide</a>
</li>
<li><a href="http://texblog.org/2013/05/06/cleveref-a-clever-way-to-reference-in-latex/">Cleveref, a clever way to reference in LaTeX</a>
</li>
<li><a href="http://www.statsravingmad.com/blog/measure/google-analytics-r-fun/?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=google-analytics-r-fun">Google Analytics + R = FUN!</a>
</li>
<li><a href="http://www.slideshare.net/jaguardesignstudio/why-zsh-is-cooler-than-your-shell-16194692">Why Zsh is Cooler than Your Shell</a>
</li>
<li><a href="http://mloss.org/revision/view/1302/">Machine learning with Haskell</a>
</li>
<li><a href="http://kbroman.wordpress.com/2013/05/10/tutorials-on-gitgithub-and-gnu-make/">Tutorials on git/github and GNU make</a>
</li>
<li><a href="http://www.continuum.io/blog/numba_growcut?utm_content=bufferdda27&amp;utm_source=buffer&amp;utm_medium=twitter&amp;utm_campaign=Buffer">Accelerating Python Libraries with Numba (Part 1)</a>
</li>
<li><a href="https://github.com/myuhe/ess-R-data-view.el">ess-R-data-view.el</a>
</li>
<li><a href="http://algs4.cs.princeton.edu/home/">Algorithms, 4th Edition by Robert Sedgewick and Kevin Wayne</a>
</li>
</ul>

</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Elsewhere</h2>
<div class="outline-text-2" id="text-5">

<ul>
<li><a href="http://blog.stephenwolfram.com/2013/05/dropping-in-on-gottfried-leibniz/">Stephen Wolfram Blog : Dropping In on Gottfried Leibniz</a>
</li>
<li><a href="http://lifehacker.com/why-our-brains-get-addicted-to-the-internet-and-how-to-499946974">Why Our Brains Get Addicted to the Internet (and How to Avoid It)</a>
</li>
<li><a href="http://bickson.blogspot.de/2013/05/fun-readings-about-startups.html?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed:+blogspot/sYXZE+(Large+Scale+Machine+Learning+and+Other+Animals)&amp;m=1">Large Scale Machine Learning and Other Animals: Fun Readings about Startups</a>
</li>
</ul>

</div>
</div>
</div>


<div class="meta">
	<div class="date">








  


<time datetime="2013-05-17T10:39:00+02:00" pubdate data-updated="true">May 17<span>th</span>, 2013</time></div>
	<div class="tags">


	<a class='category' href='/blog/categories/linkfest/'>Linkfest</a>


</div>
	
</div></article>

	<div class="share">
	<div class="addthis_toolbox addthis_default_style ">
	
	
	<a class="addthis_button_tweet"></a>
	
	
	<a class="addthis_button_google_plusone" g:plusone:size="medium"></a>
	
	<a class="addthis_counter addthis_pill_style"></a>
	</div>
  <script type="text/javascript" src="http://s7.addthis.com/js/250/addthis_widget.js#pubid="></script>
</div>



<section id="comment">
    <h2 class="title">Comments</h2>
    <div id="disqus_thread" aria-live="polite"><noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
</div>
</section>
</div>
	<footer id="footer" class="inner">Copyright &copy; 2014

    Ronert Obst

– Proud member of <a href="http://www.r-bloggers.com">www.r-bloggers.com</a>
</footer>
	<script src="/javascripts/slash.js"></script>
<script src="/javascripts/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
(function($){
	$('.fancybox').fancybox();
})(jQuery);
</script> <!-- Delete or comment this line to disable Fancybox -->


<script type="text/javascript">
      var disqus_shortname = 'everythingcounts';
      
        
        // var disqus_developer = 1;
        var disqus_identifier = 'http://ronert-obst.com/blog/2013-05-17-weekly-linkfest-17-dot-5-2013.html';
        var disqus_url = 'http://ronert-obst.com/blog/2013-05-17-weekly-linkfest-17-dot-5-2013.html';
        var disqus_script = 'embed.js';
      
    (function () {
      var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
      dsq.src = 'http://' + disqus_shortname + '.disqus.com/' + disqus_script;
      (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    }());
</script>



	<script type="text/javascript">
		var _gaq = _gaq || [];
		_gaq.push(['_setAccount', 'UA-40781735-1']);
		_gaq.push(['_trackPageview']);

		(function() {
			var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
			ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
			var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
		})();
	</script>



</body>
</html>